Tekla Open API Reference for Tekla Structures 2025
BoltHoleAttributes Class
 The bolt hole attributes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.BoltHoleAttributes
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class BoltHoleAttributes
<SerializableAttribute>
Public NotInheritable Class BoltHoleAttributes
The BoltHoleAttributes type exposes the following members.
Constructors
Name | Description
BoltHoleAttributes
 Creates a new bolt hole attributes instance.
Top
Properties
Name | Description
HoleType
 The special hole type: oversized, tapped, slotted, blind or no hole.
LongHoleX
 The long hole X value.
LongHoleY
 The long hole Y value.
SlotOffsetX
 The slot offset X value.
SlotOffsetY
 The slot offset Y value.
Top
See Also
Reference
Tekla.Structures.Model Namespace